[
{"title": "Semiconductor Chip Delivery Times Extend to Record 20 Weeks", "excerpt": "The semiconductor industry is hitting another major shortage issue, with \nlead times extending beyond 20 weeks for orders on semiconductor ...", "source": "Tom's Hardware", "date": "22 hours ago"},
{"title": "Tata group is looking to enter semiconductor manufacturing: Chandrasekaran", "excerpt": "The Tata group is looking to make a foray into semiconductor manufacturing \nand it has set up a business to seize the opportunity, Chairman N ...", "source": "Business Standard", "date": "2 days ago"},
{"title": "1 Semiconductor Stock to Buy Right Now", "excerpt": "Its products play a significant role in producing semiconductors for the \ncar industry, cementing future growth potential.", "source": "The Motley Fool", "date": "2 hours ago"},
{"title": "Semiconductor veteran confirms he's part of a £300 million plan to buy the \nUK’s largest chip plant back off China", "excerpt": "Ron Black, the former CEO of the U.K.'s Imagination Technologies which used \nto design chips for Apple, is part of a group that wants to buy ...", "source": "CNBC", "date": "23 hours ago"},
{"title": "President Tsai pushes for international semiconductor talent pool", "excerpt": "Taipei, Aug. 10 (CNA) Taiwan is hoping to collaborate with countries such \nas Japan and the United States where Taiwanese semiconductor ...", "source": "Focus Taiwan", "date": "2 days ago"},
{"title": "Micron Stock, Semiconductor Stocks Retreat Amid Memory Chip Price Forecast", "excerpt": "Micron stock fell as many semiconductor stocks retreated after a market \nresearch firm forecast weakening prices for memory devices in Q4.", "source": "Investor's Business Daily", "date": "1 day ago"},
{"title": "Your questions about the global chip shortage, answered", "excerpt": "Semiconductors are an essential part of nearly all electronics. But an \narray of factors has caused them to be in critically short supply.", "source": "Popular Science", "date": "2 days ago"},
{"title": "Neo Semiconductor Claims It Can Deliver QLC Density, SLC Performance", "excerpt": "A new company is claiming it can offer NAND SSDs the speed of SLC and the \ncapacity of QLC. ...", "source": "ExtremeTech", "date": "2 days ago"},
{"title": "On Semiconductor Is a Buy, Traders Should Add to Longs", "excerpt": "ON's stock price charts are bullish, use any dip to build or increase your \nstock position....ON.", "source": "RealMoney", "date": "2 days ago"},
{"title": "After 5G equipment, Tata Group looking to enter semiconductor manufacturing", "excerpt": "Mumbai: Tata Group is looking to make a foray into semiconductor \nmanufacturing, Chairman N Chandrasekaran said on Monday.", "source": "Mint", "date": "3 days ago"},
{"title": "Semiconductor Manufacturing: Making Impossibly Small ...", "excerpt": "But making semiconductors is about more than how fine a pattern you can \n“print” with a litho machine. Inside one of these factories, or “fabs” ...", "source": "Forbes", "date": "2 hours ago"},
{"title": "Explained: Why are the Tatas getting into semiconductor manufacturing?", "excerpt": "Why is Tata Group foraying into semiconductor manufacturing? Tata Sons \nChairman N Chandrasekaran said recently: “At the group, we have already ...", "source": "The Indian Express", "date": "7 hours ago"},
{"title": "Singapore plays catch-up with Taiwan as chip investments soar", "excerpt": "U.S. semiconductor giant GlobalFoundries will invest over $4 billion in its \nSingapore plant, increasing its capacity to about 1.5 million ...", "source": "Nikkei Asia", "date": "1 day ago"},
{"title": "Insights on the Discrete Semiconductor Global Market to 2026 - Featuring \nABB, Infineon Technologies and Hitachi Among Others - ResearchAndMarkets.com", "excerpt": "ABB Ltd · On Semiconductor Corporation (Fairchild Semiconductor) · Infineon \nTechnologies AG · STMicroelectronics NV · Toshiba Electronic Devices & ...", "source": "Yahoo Finance", "date": "2 hours ago"},
{"title": "A College of Semiconductor Research is Established at NTHU", "excerpt": "Dr. Burn J. Lin will be the first dean of the College of Semiconductor \nResearch. (Photo: National Tsing Hua University).", "source": "Business Wire", "date": "19 hours ago"},
{"title": "The United States is determined to dominate the ...", "excerpt": "The United States is determined to dominate the semiconductor tech war. 6 \nAugust 2021. Author: June Park, George Washington University. The United \nStates is ...", "source": "East Asia Forum", "date": "6 days ago"},
{"title": "Meet The Demand For Semiconductors With These Three ...", "excerpt": "Semiconductors are used in the manufacturing of various kinds of electronic \ndevices, including diodes, transistors and integrated circuits.", "source": "Forbes", "date": "6 days ago"},
{"title": "Semiconductor ETFs A Great Bet Now: Here's Why", "excerpt": "Semiconductor ETFs have been in the sweet spot thanks to surging demand for \nchips from manufacturers of everything from smartphones to cars, ...", "source": "Yahoo Finance", "date": "1 day ago"},
{"title": "Biden looks to techno-alliances to chip in on semiconductors", "excerpt": "This strategy is quietly taking shape in Japan, South Korea and Taiwan, as \nUS President Joe Biden sets out to rebuild the semiconductor ...", "source": "East Asia Forum", "date": "2 weeks ago"},
{"title": "The chips are down: Why there's a semiconductor shortage", "excerpt": "Making semiconductors is a delicate process that involves pressing layers \nof chemicals into silicon AFP/JENS SCHLUETER.", "source": "CNA", "date": "1 week ago"},
{"title": "China's foray into microchips leads to contest for talent", "excerpt": "Workers make semiconductors at a company in Guiyang, Southwest China's \nGuizhou Province on Tuesday. In recent years, China has witnessed the ...", "source": "Global Times", "date": "1 day ago"},
{"title": "The Semiconductor Shortage: Implications for the Global ...", "excerpt": "Semiconductors, more commonly known as chips, are tiny electronic devices \nthat power the functions of an abundance of digital products, ...", "source": "DBusiness Magazine", "date": "1 week ago"},
{"title": "Taiwan semiconductor firms hungry for workers; wages lag US ...", "excerpt": "Taiwan's semiconductor industry has been aggressively recruiting talent \nthis year, with its demand for workers in the second quarter rising ...", "source": "Taipei Times", "date": "3 days ago"},
{"title": "New semiconductor cools computer chips – Physics World", "excerpt": "Most semiconductors (including silicon, germanium, gallium arsenide and \ngallium nitride) and metals have Debye temperatures below 700 K, ...", "source": "Physics World", "date": "6 days ago"},
{"title": "Why US-China Rivalry Might Be Good for Singapore's ...", "excerpt": "Chartered Semiconductor was meant to help turn Singapore into a global \nmanufacturing hub for semiconductors and computer components and for a ...", "source": "The Diplomat", "date": "1 month ago"},
{"title": "China JV repositions Aemulus in semiconductor test market", "excerpt": "Tangren Microtelligence is a technology firm specialising in developing and \nmaking advanced packaging equipment for semiconductor devices. It is ...", "source": "The Edge Markets", "date": "1 day ago"},
{"title": "The Industry-Academic Cultivation Program of High-level ...", "excerpt": "Taiwan's semiconductor industry is a key force in the global supply chain, \n... The Taiwanese government officially listed the semiconductor ...", "source": "Borneo Post Online", "date": "3 hours ago"},
{"title": "Semiconductors: Europe’s expensive plan to reach the top tier of chipmakers", "excerpt": "While semiconductors are a prerequisite for emerging technologies such as \nartificial intelligence, quantum computing and autonomous vehicles, it ...", "source": "Financial Times", "date": "3 weeks ago"},
{"title": "Security concerns over chip shortage are pushing governments to act, \nMoody’s says", "excerpt": "More countries are pushing to produce their own semiconductor chips, which \nare in short supply globally, because \"it's a matter of national ...", "source": "CNBC", "date": "1 week ago"},
{"title": "indie Semiconductor Exceeds Q2 2021 Expectations and ...", "excerpt": "indie Semiconductor will host a conference call with analysts to discuss \nits second quarter 2021 results and business outlook today at 5:00 ...", "source": "Business Wire", "date": "1 day ago"},
{"title": "Foxconn to Buy Semiconductor Manufacturing Facility", "excerpt": "Foxconn to Buy Semiconductor Manufacturing Facility. The world's largest \nassembler of Apple iPhones says the purchase will help secure a steady ...", "source": "The Wall Street Journal", "date": "1 week ago"},
{"title": "Spate of Solid Q2 Earnings Fuel Semiconductor ETFs", "excerpt": "Semiconductors have taken a lead in the technology segment lately on solid \nearnings. In particular, a spate of better-than-expected reports ...", "source": "Yahoo Finance", "date": "2 days ago"},
{"title": "TSMC and Samsung: Semiconductor Chip Shortage – The ...", "excerpt": "The impact of the pandemic led to a surprising surge in demand for \nsemiconductors, which no one anticipated. The result has been long \nqueues ...", "source": "The Diplomat", "date": "2 weeks ago"},
{"title": "Singapore's semiconductor industry faces intensifying global competition", "excerpt": "THE semiconductor industry in Singapore faces increasing global \ncompetition, according to Minister of State for Trade and Industry Alvin \nTan ...", "source": "The Business Times", "date": "2 weeks ago"},
{"title": "BlackRock launches semiconductor ETF", "excerpt": "BlackRock has expanded its thematic ETF range with the launch of a global \nsemiconductor strategy. The iShares MSCI Global Semiconductors UCITS ...", "source": "ETF Stream", "date": "1 week ago"},
{"title": "Auto Industry to Benefit as Tata Plans to Start Semiconductor Production", "excerpt": "Semiconductors are used in various components of vehicles, including \ninfotainment units, instrument consoles, fuel-pressure sensors, etc.", "source": "Car Blog India", "date": "1 day ago"},
{"title": "Build an indigenous semiconductor base", "excerpt": "India must develop a semiconductor manufacturing industry, an industry that \nmanufactures the machines that are used to produce chips and an ...", "source": "The Economic Times", "date": "2 days ago"},
{"title": "Now there’s worry the chip shortage will turn into a chip glut", "excerpt": "... a shortage in semiconductors—the components vital to controlling ... to \nadvance capacity in the domestic semiconductor industry,” says ...", "source": "Fortune", "date": "1 week ago"},
{"title": "Chip lead times hit 20.2 weeks as semiconductor shortage ...", "excerpt": "Since Covid-19 began, the world has grappled with a lengthy semiconductor \nshortage. IBM's semiconductor plant, East Fishkill. – Thinkstock. The ...", "source": "Data Center Dynamics", "date": "1 day ago"},
{"title": "Semiconductor quantum dots: Technological progress and ...", "excerpt": "Semiconductor materials feature optical and electronic properties that can \nbe engineered through their composition and crystal structure. The ...", "source": "Science", "date": "6 days ago"},
{"title": "VC Company Autotech Skips Semiconductors, Backs Tesla-fying Dealerships", "excerpt": "... dealership won't but the Tesla model will, the effects of Covid will \noutlive the pandemic and semiconductors are like toilet paper.", "source": "Forbes", "date": "2 hours ago"},
{"title": "The 10 Biggest Semiconductor News Stories Of 2021 (So Far)", "excerpt": "The global chip shortage is easily the biggest story of the semiconductor \nindustry this year, but there have been plenty of other major ...", "source": "CRN", "date": "2 weeks ago"},
{"title": "These 2 Things Make NVIDIA the Best Semiconductor Stock For the 2020s", "excerpt": "The rulebook is changing for semiconductor industry success, and Nvidia's \ncombo of tech hardware licensing and software makes it the best bet ...", "source": "The Motley Fool", "date": "5 days ago"},
{"title": "Global semiconductor sales increase 29.2% to US$44.5bil in ...", "excerpt": "PETALING JAYA: Worldwide sales of semiconductors rose 29.2% to ... SIA \nrepresents 98% of the US semiconductor industry by revenue and nearly ...", "source": "The Star", "date": "1 week ago"},
{"title": "The Global Semiconductor Shortage Persist for more than ...", "excerpt": "“Semiconductor manufacturing is a globally intertwined ecosystem, which \nmakes the supply chain vulnerable to macroeconomics, geopolitics and ...", "source": "ELE Times", "date": "3 weeks ago"},
{"title": "Onsemi, formerly ON Semiconductor, now pledges to be net-zero by 2040, CEO \nsays", "excerpt": "ON Semiconductor, now known as Onsemi, plans to achieve carbon neutral \nemissions by 2040, president and CEO Hassane El-Khoury told CNBC's Jim ...", "source": "CNBC", "date": "6 days ago"},
{"title": "Semiconductor equipment sales to hit US$100bn", "excerpt": "The global semiconductor equipment market is forecast to expand to a \nrecord-high US$100 billion next year, with Taiwan regaining its top ...", "source": "Taipei Times", "date": "1 month ago"},
{"title": "SMC 2021 to Highlight Semiconductor Materials Powering ...", "excerpt": "Themed Leading Future Technology Innovations with Materials, SMC 2021 will \ngather leaders from every segment of semiconductor manufacturing to ...", "source": "HPCwire", "date": "1 week ago"},
{"title": "5 Solid Stocks to Buy on a Booming Semiconductor Market", "excerpt": "The semiconductor industry continues to thrive amid a global supply crisis \nthat has kept several other sectors under pressure.", "source": "Yahoo Finance", "date": "1 week ago"},
{"title": "Patent Filings Roundup: Litigation Funding WAGs the Dog ...", "excerpt": "A big chunk of the PTAB action was against Ocean Semiconductor LLC by \nApplied Materials, Inc., who filed five against the litigation ...", "source": "IPWatchdog.com", "date": "20 hours ago"},
{"title": "QLC at SLC speed: NEO Semiconductor's X-NAND flash ...", "excerpt": "NEO Semiconductor has patented X-NAND tech to accelerate SSD writes \nfifteenfold, and shrink die sizes. Two patents were awarded on August 5.", "source": "Blocks and Files", "date": "6 days ago"},
{"title": "Guangdong Province plans to phase in local semiconductor ...", "excerpt": "Also, a supply chain for semiconductors and integrated circuits (ICs) \nencompassing design, manufacturing, packaging and testing will be in \nplace ...", "source": "Global Times", "date": "3 days ago"},
{"title": "How Semiconductor Shortages Have Taken A Chip Out Of The Global Supply Chain", "excerpt": "While news reports on the semiconductor shortage has focused on the \nautomotive industry, most consumer electronics and hi-tech companies will \nbe ...", "source": "Forbes", "date": "1 month ago"},
{"title": "China’s semiconductor output hits record in June with support from Beijing", "excerpt": "China's semiconductor output hits record high as Beijing boosts local \nproduction amid intensifying US-China tech war · China's integrated \ncircuit ...", "source": "South China Morning Post", "date": "1 month ago"},
{"title": "With Auto Chip Shortage Easing, Are Semiconductor Equipment Stocks Still A \nBuy?", "excerpt": "The stocks in the theme have had a relatively mixed couple of days, driven \nby news from TSMC, the largest semiconductor contract manufacturer, ...", "source": "Forbes", "date": "3 weeks ago"},
{"title": "Semiconductor Surface States Enhance Wavelength ...", "excerpt": "Semiconductor Surface States Enhance Wavelength Conversion ... LOS ANGELES, \nAug. 3, 2021 — Electrical engineers from the UCLA Samueli School of \nEngineering ...", "source": "Photonics.com", "date": "1 week ago"},
{"title": "Semiconductor subsidies have skyrocketed", "excerpt": "Semiconductor subsidies have skyrocketed. From 2000-2020, the US, EU, and \nSouth Korea spent $12.5 billion total on chips—now, they've pledged a ...", "source": "Morning Brew", "date": "3 weeks ago"},
{"title": "Biden administration sounds the alarm on the semiconductor crisis", "excerpt": "Semiconductors, or computer chips, act as the brains that power our \ntechnological devices. These chips, now smaller than a stamp and thinner ...", "source": "Fortune", "date": "4 weeks ago"},
{"title": "Semiconductors: The Foundation for Nearly All Disruptive Tech", "excerpt": "“Semiconductors are essential technology enablers that power many of the \ncutting-edge digital devices in use today.", "source": "Nasdaq", "date": "15 hours ago"},
{"title": "Explained: What makes semiconductors critical to multiple industries", "excerpt": "WHAT ARE SEMICONDUCTOR CHIPS? ... Integrated into complex, microelectronic \ncircuits, semiconductors enable functions such as high-computing, ...", "source": "India Today", "date": "3 weeks ago"},
{"title": "China is buying up chip firms in a push for semiconductor supremacy, says \nUK lawmaker", "excerpt": "LONDON — A U.K. lawmaker believes China is using questionable methods to \nensure it becomes a world leader in semiconductor technology.", "source": "CNBC", "date": "4 weeks ago"},
{"title": "Tiny chip, big deal: Intel may be first to use TSMC's 3nm ...", "excerpt": "Intel will likely beat Apple to become the first company to use Taiwan \nSemiconductor Manufacturing Company's (TSMC) 3 nanometre (nm) chip, ...", "source": "Verdict", "date": "1 day ago"},
{"title": "SkyWater CEO: America Is Losing the War for Semiconductors to Asian \nManufacturers. National Security Is at Risk.", "excerpt": "About the author: Thomas Sonderman is president and CEO of SkyWater \n(ticker: SKYT), a U.S.-based semiconductor foundry.", "source": "Barron's", "date": "4 weeks ago"},
{"title": "Industry, Unions Urge Congress to Speed Semiconductor Bills", "excerpt": "Congress must act quickly to bolster semiconductor manufacturing in the \nU.S., according to a letter from several trade groups and unions ...", "source": "Bloomberg.com", "date": "3 weeks ago"},
{"title": "How the global semiconductor tussle is shaping ASML’s future", "excerpt": "However, like other semiconductor players, ASML is trapped in the \ntightening vice between the US and China as they vie for technological ...", "source": "Financial Times", "date": "3 weeks ago"},
{"title": "SoftBank Leads $200 Million Investment In Semiconductor Startup, Boosts \nLogistics Chip Space", "excerpt": "A $200 million funding round led by Japanese billionaire Masayoshi Son's \nSoftBank gave a little-known California-based semiconductor startup ...", "source": "Forbes", "date": "2 weeks ago"},
{"title": "TSMC eyes Germany as possible location for first Europe chip ...", "excerpt": "HSINCHU, Taiwan -- Taiwan Semiconductor Manufacturing Co., the world's \nlargest contract chipmaker, said on Monday it is considering building ...", "source": "Nikkei Asia", "date": "2 weeks ago"},
{"title": "Semiconductor stocks are rallying — and they still look like bargains", "excerpt": "But chip makers as a group trade below the broad indexes on a \nprice-to-earnings basis. Below is a list of the 10 semiconductor \ncompanies ...", "source": "MarketWatch", "date": "1 week ago"},
{"title": "Why Did Chip Stocks Climb Thursday? Global Semiconductor Shortage Fuels \nGains.", "excerpt": "Several auto semiconductor manufacturers such as On Semiconductor (ON) and \nNXP Semiconductors (NXPI) also saw their share prices climb briskly.", "source": "Barron's", "date": "2 weeks ago"},
{"title": "Semiconductors pose an unwelcome roadblock for carmakers", "excerpt": "A shortage of semiconductors has left car firms unable to install the ... \ncar firms found themselves low in the semiconductor pecking order: ...", "source": "The Economist", "date": "1 week ago"},
{"title": "Tencent makes foray into semiconductor chip business", "excerpt": "New postings for semiconductor chips development jobs on the official \nwebsite of Tencent have sparked speculation that the Chinese tech ...", "source": "Global Times", "date": "1 month ago"},
{"title": "GlobalFoundries to expand US HQ, increasing its ...", "excerpt": "GlobalFoundries to expand US HQ, increasing its semiconductor output. It \nalso announced a $4 billion fabrication plant in Singapore. July 26, ...", "source": "Morning Brew", "date": "2 weeks ago"},
{"title": "Chip Delivery Time Surpasses 20 Weeks in No Sign Shortage ...", "excerpt": "Chip lead times, the gap between ordering a semiconductor and taking \ndelivery ... In better news for industries that rely on semiconductors, ...", "source": "Bloomberg.com", "date": "1 day ago"},
{"title": "Taiwan's semiconductor industry hungry for workers: job bank", "excerpt": "7 (CNA) Taiwan's NT$3 trillion (US$107.9 billion) semiconductor industry \nhas been aggressively recruiting talent this year, with its demand ...", "source": "Focus Taiwan", "date": "5 days ago"},
{"title": "What this Dutch semiconductor company could tell you about the car market", "excerpt": "NXP makes semiconductors that go into both the body and brain of a car. Its \nchips make seats recline, tell windows to roll up and even let the ...", "source": "Marketplace.org", "date": "1 week ago"},
{"title": "Ford expects semiconductor rebound, new vehicle demand to increase 2021 \nprofits", "excerpt": "Despite semiconductor shortages peaking during the second quarter of 2021, \nFord says it delivered better-than-expected operating results by ...", "source": "TechCrunch", "date": "2 weeks ago"},
{"title": "Transparency Is Critical as Semiconductor Industry Works to Meet Surging \nDemand", "excerpt": "As the semiconductor industry grapples with surging demand, transparency \ninto the supply chain is critical, according to Mike Splinter, chairman ...", "source": "Nasdaq", "date": "1 month ago"},
{"title": "Semiconductor Manufacturing Market Size, And Forecast | Key ...", "excerpt": "Semiconductor Manufacturing Market Size, And Forecast | Key Players: AMI \nSemiconductor, Advanced Semiconductor Engineering, Analog Devices, ...", "source": "The Market Writeuo -", "date": "16 hours ago"},
{"title": "Taiwan Semiconductor's Earnings Raise Doubts Over Outlook", "excerpt": "Taiwan Semiconductor Manufacturing Co. had good news and bad news for tech \ninvestors. The company reported second-quarter revenue that was a ...", "source": "Barron's", "date": "1 month ago"},
{"title": "ON Semiconductor stock surges after record earnings that beat expectations, \nupbeat outlook", "excerpt": "ON Semiconductor stock surges after record earnings that beat expectations, \nupbeat outlook. Published: Aug. 2, 2021 at 8:17 a.m. ET. By. Tomi Kilgore.", "source": "MarketWatch", "date": "1 week ago"},
{"title": "Intel's CEO lays out plan to reclaim semiconductor crown", "excerpt": "The race is on at Intel Corp. as the semiconductor giant pledges to return \nto the top of its game, committing to produce the world's best ...", "source": "MarketWatch", "date": "2 weeks ago"},
{"title": "Cohu vs. ACM Research: Which Semiconductor Equipment ...", "excerpt": "Read more to find out.Semiconductor stocks are still the talk of Wall \nStreet, mainly because the chip shortage continues to drag on. The \ndemand ...", "source": "Investing.com", "date": "19 hours ago"},
{"title": "This Semiconductor Growth Stock Just Crushed Earnings", "excerpt": "Cohu is seeing robust demand for its semiconductor-related products and \nservices. While keeping expenses under control in Q2, Cohu grew revenue ...", "source": "The Motley Fool", "date": "1 week ago"},
{"title": "Global semiconductor shortage: More challenging times ahead for Europe’s \nmajor carmakers", "excerpt": "Global semiconductor shortage: More challenging times ahead for Europe's \nmajor carmakers. BMW ...", "source": "Euronews", "date": "1 week ago"},
{"title": "Peking University joins China's semiconductor push ...", "excerpt": "HONG KONG: China's prestigious Peking University has set up a semiconductor \nschool to train chip engineers and technicians, ...", "source": "The Bangkok Post", "date": "3 weeks ago"},
{"title": "Europe's call for semiconductor factories: A solution in search ...", "excerpt": "Supply chain bottlenecks and chip shortages for the car industry have led \nto calls for Europe to develop its own semiconductor capacity.", "source": "LSE Blogs", "date": "1 week ago"},
{"title": "ON Semiconductor Reports Record Revenue and Non-GAAP Earnings per Share for \nSecond Quarter 2021", "excerpt": "ON Semiconductor Reports Record Revenue and Non-GAAP Earnings per Share for \nSecond Quarter 2021. August 2, 2021 ·11 min read. In this article:.", "source": "Yahoo Finance", "date": "1 week ago"},
{"title": "Semiconductor issues may linger in Q2 but production catching up: Motherson \nSumi", "excerpt": "The auto ancillary company reported earnings for the June-ended quarter, \nbeing hit by semiconductor shortage globally.", "source": "CNBCTV18", "date": "1 day ago"},
{"title": "Semiconductor Chips: Small Tech, Big Impact", "excerpt": "As this Forbes article explains, semiconductors power most of the \nelectronics we use today. Perhaps even the device you're using to read \nthis ...", "source": "Forbes", "date": "2 weeks ago"},
{"title": "Semiconductor wafer producer SK Siltron CSS to invest $300M in US to boost \nEV supply chain", "excerpt": "Now, it might be strengthening that hold. SK Siltron CSS, a unit of South \nKorean semiconductor wafer manufacturer SK Siltron, announced ...", "source": "TechCrunch", "date": "1 month ago"},
{"title": "ON Semiconductor Corporation (ON) Q2 2021 Earnings Call Transcript", "excerpt": "Good morning, and thank you for joining ON Semiconductor Corporation's \nsecond quarter 2021 quarterly results conference call. I'm joined today ...", "source": "The Motley Fool", "date": "1 week ago"},
{"title": "Alpha and Omega Semiconductor Limited's (AOSL) CEO Mike Chang on Q4 2021 \nResults - Earnings Call Transcript", "excerpt": "Alpha and Omega Semiconductor Limited (AOSL) Q4 2021 Earnings Conference \nCall August 11, 2021 5:00 PM ET. Company Participants.", "source": "Seeking Alpha", "date": "8 hours ago"},
{"title": "Miami builder has more homes coming near future Taiwan Semiconductor plant \nin north Phoenix", "excerpt": "PHOENIX — Hundreds of homes are being planned near the Taiwan Semiconductor \nManufacturing Co. Ltd.'s 1,128-acre manufacturing plant under ...", "source": "ABC15 Arizona", "date": "2 days ago"},
{"title": "Efficient energy transport in an organic semiconductor ...", "excerpt": "Efficient energy transport is desirable in organic semiconductor (OSC) \ndevices. However, photogenerated excitons in OSC films mostly occupy ...", "source": "Science Advances", "date": "1 week ago"},
{"title": "Intel wants to buy AMD's old chip-making business? How weird are \nsemiconductor mergers going to get?", "excerpt": "How weird are semiconductor mergers going to get? Last Updated: July 17, \n2021 at 3:24 p.m. ET First Published: July 15, 2021 at 10:33 p.m. ET.", "source": "MarketWatch", "date": "1 month ago"},
{"title": "Frontken 2Q earnings climb to RM24.74mil on strong ...", "excerpt": "The semiconductor manufacturing services provider said revenue was up \n23.97% year-on-year (y-o-y) to RM108.63mil from RM87.62mil as volume ...", "source": "The Star", "date": "2 weeks ago"},
{"title": "Is It Too Late to Buy This Semiconductor Stock After 58% Gains?", "excerpt": "The growing appetite for semiconductors has turned out to be a boon for \nASML. · The company has seen a sharp spike in revenue and earnings as \nthe ...", "source": "The Motley Fool", "date": "1 week ago"},
{"title": "ON Semiconductor changes its name and looks toward a green future", "excerpt": "ON Semiconductor (Nasdaq: ON) is now known as onsemi and the company said \nthe shift goes hand in hand with its renewed focus on the ...", "source": "ABC15 Arizona", "date": "5 days ago"},
{"title": "Analysts up Inari Amertron TPs after semiconductor maker ...", "excerpt": "Last Friday, Inari, which also offers outsourced semiconductor assembly and \ntest services, said in a Bursa Malaysia filing that its net ...", "source": "The Edge Markets", "date": "3 days ago"},
{"title": "Semiconductor shortages could last into 2023, Supplyframe ...", "excerpt": "A global shortage of semiconductors could stretch into the first ... \nComputer chips are in short supply as semiconductor production and ...", "source": "Supply Chain Quarterly", "date": "2 weeks ago"},
{"title": "Is This the Best Semiconductor Stock Right Now?", "excerpt": "ASML's unique position in the semiconductor market makes it a must-have in \na long-term portfolio. Neil Rozenbaum. (TMFCouchInvestor).", "source": "The Motley Fool", "date": "2 weeks ago"},
{"title": "Semiconductor industry faces concerns about making too many chips", "excerpt": "Texas Instruments, one of world's largest chip makers, worries industry \nwill make too many semiconductors. Amid a surge in investment to expand ...", "source": "South China Morning Post", "date": "3 weeks ago"},
{"title": "Why chip stocks are falling despite semiconductor shortage, strong early \nearnings", "excerpt": "Why chip stocks are falling despite semiconductor shortage, strong early \nearnings. Last Updated: July 23, 2021 at 8:20 a.m. ET First Published: ...", "source": "MarketWatch", "date": "3 weeks ago"},
{"title": "What the U.S. Is Doing About Semiconductor Shortages ...", "excerpt": "Global semiconductor supply chain woes have been dragging on for months as \ndemand for these chips continues to exceed what the domestic ...", "source": "Built In", "date": "3 weeks ago"},
{"title": "Lam Research tops $4 billion in quarterly sales for first time amid \nsemiconductor shortage", "excerpt": "Lam Research Corp. sold more than $4 billion worth of \nsemiconductor-manufacturing equipment and services in a single quarter for \nthe first ...", "source": "MarketWatch", "date": "2 weeks ago"},
{"title": "Semiconductor Market in East Asia to grow by USD 84.41 ...", "excerpt": "Semiconductor Market in East Asia industry analysis. The growth of the \nconsumer electronics market will offer immense growth opportunities.", "source": "PR Newswire", "date": "1 week ago"},
{"title": "Decoded | Impact of semiconductor chip shortage on global economy", "excerpt": "Semiconductor chips are made from silicon as it is a good electricity \nconductor. These chips are fitted into microcircuits that powers \nnumerous ...", "source": "India Today", "date": "4 weeks ago"},
{"title": "Taiwan gives TSMC green light for most advanced chip plant", "excerpt": "TAIPEI -- Taiwan Semiconductor Manufacturing Co. has received final \napproval to build its most advanced chip plant yet, a day after U.S. ...", "source": "Nikkei Asia", "date": "2 weeks ago"},
{"title": "NXP Semiconductors to Present at Upcoming Investor Conference", "excerpt": "EINDHOVEN, The Netherlands, Aug. 10, 2021 (GLOBE NEWSWIRE) -- NXP \nSemiconductors N.V. (NASDAQ: NXPI) today announced participation at the ...", "source": "Yahoo Finance", "date": "1 day ago"},
{"title": "GlobalFoundries to double semiconductor capacity in US | News", "excerpt": "A wafer is a thin slice of semiconductor, such as a crystalline silicon, \nused for the fabrication of integrated circuits. Both moves are designed to \naddress the ...", "source": "Automotive Logistics", "date": "3 weeks ago"},
{"title": "From Ford trucks to Xbox, the chip shortage is still causing problems", "excerpt": "When car demand returned and automakers needed semiconductors again, ... \nconcluded a 100-day review of the US semiconductor supply chain, ...", "source": "Vox", "date": "6 days ago"},
{"title": "Neo Semiconductor Claims It Can Deliver QLC Density, SLC ...", "excerpt": "According to Neo Semiconductor, it's developed a method of building NAND \nthat offers the performance of SLC and the density of QLC.", "source": "ExtremeTech", "date": "2 days ago"},
{"title": "The global chip shortage is starting to hit the smartphone industry", "excerpt": "Semiconductors have been in short supply this year, due to a number of ... \nSyed Alam, Accenture's global semiconductor lead, told CNBC.", "source": "CNBC", "date": "2 weeks ago"},
{"title": "AKHAN Semiconductor Fabricates First of its Kind 300MM ...", "excerpt": "To produce the world's most advanced technologies, semiconductor \nfabricators traditionally rely on 300MM silicon wafers despite the fact \nthat ...", "source": "Business Wire", "date": "2 weeks ago"},
{"title": "Global Compound Semiconductor Market Growth Analysis in ...", "excerpt": "NEW YORK, July 23, 2021 /PRNewswire/ -- The global compound semiconductor \nmarket is expected to grow by USD 11.53 billion, progressing a ...", "source": "PR Newswire", "date": "3 weeks ago"},
{"title": "Semiconductor global shortage impacting Barrie | CTV News ...", "excerpt": "-- A global shortage of semiconductors, a small computer chip used in new \nvehicles, is leaving many car dealerships in Barrie looking empty. “It ...", "source": "CTV News Barrie", "date": "2 days ago"},
{"title": "China vehicle sales decline in July amid COVID-19 outbreaks, semiconductor \nshortage", "excerpt": "... sales decline in July amid COVID-19 outbreaks, semiconductor shortage \n... in other areas and the global shortage of semiconductors.", "source": "Business Today", "date": "1 day ago"},
{"title": "Is Taiwan Semiconductor Manufacturing Co. (TSM) A Smart Long-Term Buy?", "excerpt": "In the Q2 2021 investor letter of Wedgewood Partners, the fund mentioned \nTaiwan Semiconductor Manufacturing Company Limited (NYSE: TSM), ...", "source": "Yahoo Finance", "date": "3 weeks ago"},
{"title": "Silicon Carbide Semiconductor Market Present Scenario and ...", "excerpt": "Silicon Carbide Semiconductor Market Present Scenario and Growth Analysis \ntill 2026 by Types (General Type) by Applications (• Industrial, • ...", "source": "The Market Writeuo -", "date": "8 hours ago"},
{"title": "Shanghai’s big vision to lead world in next-gen tech is light on detail", "excerpt": "Shanghai wants to lead world in semiconductors, AI and electric cars, but \nplan to boost economy is light on detail. Companies are taking a wait- ...", "source": "South China Morning Post", "date": "2 weeks ago"},
{"title": "Global HDMI and DisplayPort Market Sizes 2021| Lattice ...", "excerpt": "Global HDMI and DisplayPort Market Sizes 2021| Lattice Semiconductor, NXP \nSemiconductors, STMicroelectronics. August 12, 2021. 10 Min Read.", "source": "The Market Writeuo -", "date": "1 hour ago"},
{"title": "Former Imagination Technologies CEO considers bid for Welsh semiconductor \nplant", "excerpt": "He added that the consortium is made up of three semiconductor businesses \nand ... in critical global supply chains, such as semiconductors”.", "source": "IT PRO", "date": "1 hour ago"},
{"title": "Semiconductor Testing Boards Market 2021 | Covid19 Impact ...", "excerpt": "Semiconductor Testing Boards Market 2021 | Covid19 Impact Analysis | Size, \nShare, Strategies And Forecast To 2027: FastPrint, OKI Printed ...", "source": "The Market Writeuo -", "date": "28 mins ago"},
{"title": "BE Semiconductor beats Q2 revenue forecasts on higher ...", "excerpt": "The Dutch-based maker of semiconductor assembly and packaging equipment \nadded it expected revenues in the third quarter to fall by 5%-15% from ...", "source": "Reuters", "date": "2 weeks ago"},
{"title": "2 Semiconductor-Service Growth Stocks to Own Now", "excerpt": "The automotive industry has been hit hard by semiconductor shortages. · \nBoth of these companies offer unique solutions to help expand production ...", "source": "The Motley Fool", "date": "3 weeks ago"},
{"title": "Acquisition of UK's largest chip plant demonstrates UKs ...", "excerpt": "Recently, it was announced that Nexperia is in the process of acquiring the \nUK's largest semiconductor fabrication plant Newport Wafer Fab.", "source": "Electropages", "date": "3 weeks ago"},
{"title": "Daimler says semiconductor shortage to last into 2022", "excerpt": "LONDON, July 21 (Reuters) - Mercedes-Benz maker Daimler AG said on \nWednesday that the global semiconductor shortage will last into 2022 and ...", "source": "Reuters", "date": "3 weeks ago"},
{"title": "Nissan 'cannot be optimistic' about the ongoing global chip shortage, CEO \nsays", "excerpt": "Uchida believes the chip shortage situation will improve but he warned \nthere are “many complexities” surrounding semiconductor suppliers as ...", "source": "CNBC", "date": "2 weeks ago"},
{"title": "Intel is poised for earnings drop amid semiconductor shortage", "excerpt": "... in second-quarter earnings as Chief Executive Pat Gelsinger works to \nturn the chip giant around amid a global semiconductor shortage.", "source": "Mint", "date": "3 weeks ago"},
{"title": "Low semiconductor supplies may not be the main reason for PS5 shortages", "excerpt": "Low semiconductor supplies may not be the main reason for PS5 shortages. \nPlans to make 14.8 million consoles this fiscal year may still fall ...", "source": "Ars Technica", "date": "1 week ago"},
{"title": "Dingell proposes $2 billion in federal semiconductor spending", "excerpt": "Debbie Dingell, D-Dearborn. The bill comes amid an ongoing semiconductor \nshortage that has forced shutdowns at auto plants and threatens to cut ...", "source": "Detroit News", "date": "2 weeks ago"},
{"title": "Semiconductor certificate moves students from lab to fab", "excerpt": "Simultaneously, Taiwan Semiconductor Manufacturing Company has started \nconstruction on a north Phoenix fab that will create up to 1,900 new \njobs ...", "source": "ASU Now", "date": "2 weeks ago"},
{"title": "Semiconductor shortage to ‘outlast’ Covid-19 pandemic", "excerpt": "Fleet decision-makers are being warned that the global semiconductor \nshortage will have a greater impact on the automotive industry than the ...", "source": "Fleet News", "date": "1 week ago"},
{"title": "Upton, Meijer send letter to House leadership urging action on \nsemiconductor shortage", "excerpt": "Semiconductors are used for features like touchscreens, navigation systems \n... \"While the U.S. is a world leader in semiconductor design, ...", "source": "Holland Sentinel", "date": "1 week ago"},
{"title": "How Toyota kept making cars when the chips were down", "excerpt": "The unexpected spike in demand wasn't the only factor in the shortage: A \nseries of unpredictable disasters also tangled the semiconductor supply ...", "source": "Fortune", "date": "1 week ago"},
{"title": "Car chip shortage to abate, smartphones could be next ...", "excerpt": "July 23 (Reuters) - The semiconductor shortage that has gripped the world \ncould last well into 2022 and hit smartphone production next, ...", "source": "Reuters", "date": "3 weeks ago"},
{"title": "Behind the deal: Courting Taiwan Semiconductor took years ...", "excerpt": "Behind the deal: Courting Taiwan Semiconductor took years. Now, it's on a \nstrict timeline ... “Who would have ever thought in my career I'd be ...", "source": "The Business Journals", "date": "3 weeks ago"},
{"title": "Inhibited nonradiative decay at all exciton densities in ...", "excerpt": "Even with the application of strain, the semiconductor remained ... The \nphotophysics of these monolayer semiconductors as a function of Vg ...", "source": "Science", "date": "3 weeks ago"},
{"title": "Semiconductor fab and civil nukes new focus of UK-China ...", "excerpt": "Meanwhile, the former cyber-security chief has spoken out against the sale \nof the country's largest semiconductor factory to a ...", "source": "E&T Magazine", "date": "2 weeks ago"},
{"title": "China’s push for semiconductor self-reliance takes...", "excerpt": "CHINA'S strategic move to invest funds to achieve a 70% self-sufficiency \nratio in semiconductors by 2025 could boost its tech sector growth ...", "source": "The Malaysian Reserve", "date": "1 week ago"},
{"title": "Strongest Semiconductor Stocks to Buy That Aren’t Nvidia", "excerpt": "It's hard to imagine a more bullish scenario for semiconductor stocks than \nthe current global chip shortage. With the COVID-19 pandemic ...", "source": "TheStreet", "date": "1 month ago"},
{"title": "Hedge Funds Are Buying Lattice Semiconductor Corporation (LSCC)", "excerpt": "Is Lattice Semiconductor Corporation (NASDAQ:LSCC) an excellent investment \ntoday? The best stock pickers were getting more bullish.", "source": "Yahoo Finance", "date": "3 weeks ago"},
{"title": "Fabs, Fabless and Indian Semiconductor Industry", "excerpt": "Comparing semiconductor production to a mineral like crude oil is a \nnon-starter. No amount of policy or human ingenuity can extract oil from \na ...", "source": "Swarajya", "date": "2 weeks ago"},
{"title": "Tata Motors to redesign vehicles to reduce impact of semiconductor crisis", "excerpt": "Tata Motors to redesign vehicles to reduce impact of semiconductor crisis \n... crisis due to lack of supply of semiconductors in coming days.", "source": "Hindustan Times Auto News", "date": "2 weeks ago"},
{"title": "Sale of semiconductor factory to Chinese-owned firm presents bigger UK risk \nthan Huawei", "excerpt": "Semiconductors allow electricity to flow through devices and are crucial \ncomponents in medical equipment, smartphones, radios and TVs.", "source": "The Telegraph", "date": "3 weeks ago"},
{"title": "Japan seeks new ways to strengthen semiconductor production", "excerpt": "When the COVID-19 pandemic disrupted semiconductor supply chains and \ntriggered shortages worldwide, it laid bare just how much Japan relies \non ...", "source": "NHK.JP", "date": "6 days ago"},
{"title": "GM will cut truck production amid semiconductor shortage", "excerpt": "N) said Wednesday it will cut some truck production in North America \nbecause of the ongoing global semiconductor shortage.", "source": "Reuters", "date": "3 weeks ago"},
{"title": "New Research Center Focuses on Semiconductor Security", "excerpt": "Semiconductor chips — often referred to as simply semiconductors — make it \npossible for electronic devices to process, store and transmit data.", "source": "UT Dallas News Center", "date": "4 weeks ago"},
{"title": "Staff and semiconductor shortages stifle UK new car output", "excerpt": "By the end of 2021, the UK could lose up to 100,000 new cars as a result of \nthe semiconductor shortage and other factors hampering the sector's ...", "source": "Autocar", "date": "2 weeks ago"},
{"title": "Semiconductor shortage will take 1-2 years to stabilize markets, Intel CEO \nsays", "excerpt": "The global shortage of semiconductors that has hobbled the auto industry \nand made some consumer electronics more expensive could last until ...", "source": "WRAL TechWire", "date": "3 weeks ago"},
{"title": "Tesla reveals its secret to surviving semiconductor shortages", "excerpt": "Tesla has been one company that has demonstrated an incredible response to \nthe global semiconductor shortage, a challenge that has plagued ...", "source": "Teslarati.com", "date": "2 weeks ago"},
{"title": "Semiconductor Shortage Hits US Manufacturing in June: Fed", "excerpt": "A shortage of semiconductors hampered U.S. auto production in June, \ncontributing to worse-than-expected factory output, the Federal Reserve \nreported ...", "source": "IndustryWeek", "date": "4 weeks ago"},
{"title": "Texas reigns in semiconductor, wind power sectors, according ...", "excerpt": "Samsung has had a chipmaking campus in North Austin for the past 25 years, \nwhere it has already invested $17 billion. NXP Semiconductors NV also ...", "source": "The Business Journals", "date": "2 weeks ago"},
{"title": "Semiconductor wafer manufacturer planning $300M expansion in Bay County", "excerpt": "SK Siltron CSS manufactures a specialty wafer made of silicon carbide that \ncan be used in the semiconductor power components of electric ...", "source": "MLive.com", "date": "4 weeks ago"},
{"title": "US preps semiconductor factory plans amid shortage: EXCLUSIVE", "excerpt": "... semiconductor chip factories in the U.S. within 18 months of the date \nthat Biden signs the Innovation and Competition Act into law.", "source": "Fox Business", "date": "3 weeks ago"},
{"title": "These Bendy Plastic Chips Fit in Unusual Places", "excerpt": "Researchers think these flexible semiconductors will be able to monitor \nyour heartbeat or tell you whether your milk has spoiled.", "source": "WIRED", "date": "3 weeks ago"},
{"title": "Intel Drops A Bomb On The Semiconductor Industry", "excerpt": "Investment Thesis. Moore's Law is the bread and butter of the semiconductor \nindustry: a final silicon chip can only ever be as good as the ...", "source": "Seeking Alpha", "date": "2 weeks ago"},
{"title": "Semiconductor supply company moving to larger space in Chandler", "excerpt": "PHOENIX – A company based in the Netherlands that supplies products and \nsupport to semiconductor manufacturers is increasing its presence in ...", "source": "KTAR News", "date": "3 weeks ago"},
{"title": "Semiconductor Supply Shortages To Ease In 2-3 Quarters: Report", "excerpt": "Semiconductors in particular and electronics in general are the few \nremaining areas of localization in the Indian Automotive supply chain. \nWith ...", "source": "Goodreturns", "date": "2 weeks ago"},
{"title": "State of Texas: Lawmakers seek solutions for semiconductor shortages to \nimprove national security", "excerpt": "AUSTIN (Nexstar) — America needs to think differently when it comes to \nboosting manufacturing of semiconductor chips, according to one Texas ...", "source": "KXAN Austin", "date": "2 weeks ago"},
{"title": "Is the world too dependent on Asia’s semiconductor industry?", "excerpt": "The Asia Pacific is also the world's biggest market for semiconductors, \naccounting for 60% of global semiconductor sales, with China alone ...", "source": "Tech Wire Asia", "date": "26 Mar 2021"},
{"title": "Everything you need to know about the global semiconductor shortage", "excerpt": "Beyond consumer electronics, the tight supply has begun to impact China's \ngiant home appliance manufacturing sector. Topic | Semiconductors.", "source": "South China Morning Post", "date": "12 May 2021"},
{"title": "IBM Chips In To Drive 2 Nanometer Semiconductor Manufacturing", "excerpt": "First, the company continued to do fundamental research in semiconductor \ntechnologies at its facilities in New York, usually in conjunction ...", "source": "The Next Platform", "date": "6 May 2021"},
{"title": "Commentary: There is a global semiconductor famine and it ...", "excerpt": "Semiconductors, responsible for microchips that power everything from \ncomputers to cars has been hit with a global shortage thanks to the ...", "source": "CNA", "date": "9 Mar 2021"},
{"title": "Stocks That Benefit As U.S. Reshores Semiconductor Production", "excerpt": "Moreover, demand for semiconductor fabrication equipment is also likely to \ngrow, as the U.S. government has been taking steps to protect its ...", "source": "Forbes", "date": "1 month ago"},
{"title": "Will The US Let The Chips Fall On Semiconductor Policy?", "excerpt": "There is bipartisan, bicameral support in Congress for the Creating Helpful \nIncentives to Produce Semiconductors for America Act (CHIPS for ...", "source": "Forbes", "date": "31 May 2021"},
{"title": "Semiconductor cycle out of balance after customers stock up", "excerpt": "In an industry as cyclical as semiconductors, there is always either too \nmuch or too little supply. For the companies that design and use ...", "source": "Financial Times", "date": "15 Feb 2021"},
{"title": "US senators propose 25per cent tax credit for semiconductor ...", "excerpt": "WASHINGTON: A bipartisan group of U.S. senators on Thursday proposed a \n25per cent tax credit for investments in semiconductor manufacturing ...", "source": "CNA", "date": "1 month ago"},
{"title": "South Korea to spend $451 billion on becoming a ...", "excerpt": "“The entire semiconductor industry is facing a watershed moment and now is \nthe time to chart out a plan for long-term strategy and investment,” ...", "source": "Data Center Dynamics", "date": "14 May 2021"},
{"title": "The EU must play a long game for semiconductor success", "excerpt": "Sign up to myFT Daily Digest to be the first to know about Semiconductors \nnews. The writer is chief executive of Intel. Technology has never ...", "source": "Financial Times", "date": "28 Apr 2021"},
{"title": "Why semiconductors are as scarce as gold", "excerpt": "Chips production starts with wafers. A wafer (slice of semiconductor) acts \nas a substrate for microelectronic devices. Many so-called integrated ...", "source": "ING Think", "date": "8 Apr 2021"},
{"title": "New Chinese chip firms have tripled in 2021 amid self-sufficiency push", "excerpt": "As China pursues self-sufficiency in semiconductors, Washington is seeking \nto counter Beijing with a new bill funding domestic fabrication.", "source": "South China Morning Post", "date": "9 Jun 2021"},
{"title": "How the world ran out of semiconductors", "excerpt": "There's a global shortage in semiconductors, and it's becoming increasingly \nserious. The US is currently reviewing its supply of the ...", "source": "The Conversation", "date": "5 Mar 2021"},
{"title": "Japan puts all chips on the table to lure semiconductor makers", "excerpt": "TOKYO -- Japan will pull out every policy stop to court overseas \nsemiconductor companies, including offering generous financial \nincentives, ...", "source": "Nikkei Asia", "date": "3 Jun 2021"},
{"title": "China Turns Semiconductors Into The ‘New Oil’ While GM Runs Out Of Chips", "excerpt": "China Turns Semiconductors Into The 'New Oil' While GM Runs Out Of Chips · \nChina International Semiconductor Expo. Visitors look at 5G chips at ...", "source": "Forbes", "date": "7 Feb 2021"},
{"title": "US to lead world again, Biden tells CEOs at semiconductor ...", "excerpt": "Heads of 19 companies, including Taiwan Semiconductor Manufacturing Co., \nSamsung's Device Solutions Division, Intel, Medtronic and Micron, are ...", "source": "Nikkei Asia", "date": "13 Apr 2021"},
{"title": "About That White House Meeting To Discuss The Semiconductor Supply Chain", "excerpt": "On top of that, sanctions against Semiconductor Manufacturing International \nCompany (SMIC) made this worse, as producers shifted even more ...", "source": "Forbes", "date": "12 Apr 2021"},
{"title": "How Asia came to dominate chipmaking and what the U.S. wants to do about it", "excerpt": "Taiwan's TSMC and South Korea's Samsung Electronics control more than 70% \nof the semiconductor manufacturing market. A global semiconductor ...", "source": "CNBC", "date": "11 Apr 2021"},
{"title": "China’s semiconductor output hits all-time high amid global shortage", "excerpt": "China's semiconductor output in May hits all-time high amid chip shortage \nand tech war with US. China's IC output in May surged 37.6 per cent ...", "source": "South China Morning Post", "date": "16 Jun 2021"},
{"title": "Why semiconductors are important in the US-China tech war", "excerpt": "A semiconductor is a substance that conducts electricity under some \nconditions but not others, making it a good medium to control electrical ...", "source": "South China Morning Post", "date": "29 Oct 2020"},
{"title": "China's progress in advanced semiconductor technology slows", "excerpt": "SHANGHAI -- China is facing delays in miniaturizing semiconductors. In a \nNikkei survey, most of the seven major Chinese semiconductor ...", "source": "Nikkei Asia", "date": "9 May 2021"},
{"title": "Boom quarter for top 10 semiconductor companies", "excerpt": "Samsung, with total growth of 25 per cent, is catching up on Intel which \nwhile the largest supplier was the only major semiconductor company to ...", "source": "eeNews Europe", "date": "25 May 2021"},
{"title": "Why We're in the Midst of a Global Semiconductor Shortage ...", "excerpt": "Business and financial media have detailed how the shortage of \nsemiconductors has caused production cutbacks in the automotive industry: \nFord, ...", "source": "Harvard Business Review", "date": "26 Feb 2021"},
{"title": "Japan to co-develop cutting-edge chip tech with Taiwan's TSMC", "excerpt": "Japan has signed off on a US$338 million semiconductor research ... the \nmarket-leading Taiwan Semiconductor Manufacturing Company (TSMC).", "source": "Tech Wire Asia", "date": "4 Jun 2021"},
{"title": "China’s universities rush to set up new semiconductor programmes", "excerpt": "China's Ministry of Education has made semiconductor science and \nengineering a priority academic programme; That has encouraged more ...", "source": "South China Morning Post", "date": "1 month ago"},
{"title": "Lagging but motivated: The state of China's semiconductor ...", "excerpt": "Every year, China imports more than $300 billion of semiconductors, and \nmost, though not all, major American semiconductor companies pull in at ...", "source": "Brookings Institution", "date": "7 Jan 2021"},
{"title": "China's semiconductor IP sector accelerates drive for self ...", "excerpt": "The semiconductor intellectual property (IP) sector in China is growing \nrapidly by the day, with tens of thousands of chip design companies ...", "source": "Global Times", "date": "19 May 2021"},
{"title": "Rising Revenues And Margins Could Drive ON Semiconductor Stock To $45", "excerpt": "Up around 3.5x from its low in March 2020, at the current price of $38 per \nshare, we believe ON Semiconductor stock (NASDAQ: ON) has further ...", "source": "Forbes", "date": "7 Jun 2021"},
{"title": "Semiconductors: Chinese takeover of UK's leading chipmaker doesn't need a \nsecurity review – here's why", "excerpt": "Chinese state-backed conglomerate Wingtech Technology is taking full \ncontrol of the UK's largest semiconductor foundry, Newport Wafer Fab ...", "source": "The Conversation", "date": "1 month ago"},
{"title": "Envisioning the Indian Semiconductor Ecosystem to be at Par ...", "excerpt": "To dive deep into the semiconductor market of India and the growth \nprospects of setting up Fabless manufacturing units in India, ELE \nTimes's ...", "source": "ELE Times", "date": "1 month ago"},
{"title": "Why the semiconductor shortage won't end soon | Penn Today", "excerpt": "Morris A. Cohen of the Wharton School explains the impact of the shortage \nof semiconductors that is currently affecting economies around the ...", "source": "Penn Today", "date": "19 Mar 2021"},
{"title": "The World Is Dangerously Dependent on Taiwan for ...", "excerpt": "That's mostly down to Taiwan Semiconductor Manufacturing Co., ... it was \nable to cut off the supply of semiconductors from TSMC and other ...", "source": "Bloomberg.com", "date": "25 Jan 2021"},
{"title": "Japan Seeks to Revive Stalled Semiconductor Industry ...", "excerpt": "Both nations have launched aggressive funding measures to revive their \nlocal semiconductor industries. And if Japan refuses to invest due to \nits ...", "source": "Supply Chain Digital", "date": "1 month ago"},
{"title": "China chases semiconductor self-sufficiency", "excerpt": "Huawei's Kirin chipsets are made by Taiwan Semiconductor Manufacturing \nCompany (TSMC) using US technology and equipment. The technological gap ...", "source": "East Asia Forum", "date": "22 Feb 2021"},
{"title": "Taiwan pledges to boost semiconductor supply to Europe ...", "excerpt": "Taiwan's high-tech chip manufacturing plants are among the largest and most \nadvanced in the world, with the Taiwan Semiconductor Manufacturing ...", "source": "The Straits Times", "date": "11 May 2021"},
{"title": "U.K. Sold Off $42 Billion of Semiconductor Firms Before Review", "excerpt": "The U.K. was once the leading semiconductor innovator in Europe, producing \nthe likes of Arm Ltd., whose technology is found in 90% of all ...", "source": "Bloomberg.com", "date": "1 month ago"},
{"title": "Governments are deploying 'wartime-like' efforts to win the global \nsemiconductor race", "excerpt": "These clever semiconductors make our internet-connected world go round. ... \nThrough the so-called \"K-Semiconductor Strategy,\" the South ...", "source": "CNBC", "date": "17 May 2021"},
{"title": "U.S. chipmaker invests $4 billion in Singapore, even as Congress tries to \nlure manufacturers home", "excerpt": "“GlobalFoundries is meeting the challenge of the global semiconductor \nshortage by accelerating our investments around the world,” CEO Tom ...", "source": "Fortune", "date": "1 month ago"},
{"title": "Q&A: Electronics and Semiconductor Industry in Vietnam", "excerpt": "Businesses investing in the semiconductor industry are eligible for \npreferential incentives such as zero percent corporate income tax for \nthe ...", "source": "Vietnam Briefing", "date": "1 month ago"},
{"title": "US, China to set up working group to ease tension in global chips industry", "excerpt": "to ease a global shortage of chips, a move that could help Chinese firms, \nfrom Huawei Technologies to Shanghai-based Semiconductor ...", "source": "South China Morning Post", "date": "11 Mar 2021"},
{"title": "China to waive import taxes for semiconductor companies until 2030", "excerpt": "Chinese chip makers, including top player Semiconductor Manufacturing \nInternational Corporation (SMIC), rely heavily on foreign technologies.", "source": "South China Morning Post", "date": "30 Mar 2021"},
{"title": "Breakthrough in chips materials could push back the ‘end’ of Moore’s Law", "excerpt": "US-China tech war: TSMC helps make breakthrough in semiconductor ... of \nsemiconductors in a race to own a key piece future technology.", "source": "South China Morning Post", "date": "19 May 2021"},
{"title": "15 Biggest Semiconductor Companies in the World", "excerpt": "Semiconductors may be pure elements, such as silicon or germanium, or \ncompounds such as gallium arsenide or cadmium selenide. Semiconductors \nare ...", "source": "Yahoo Finance", "date": "6 Jan 2021"},
{"title": "Investment outlook for semiconductors amid rising global chip ...", "excerpt": "Semiconductor companies may not be as headline-grabbing as their big tech \ncounterparts such as Apple, Google and Facebook.", "source": "CNA", "date": "7 Apr 2021"},
{"title": "Could the Geopolitical Climate Hamper the Semiconductor ...", "excerpt": "While historically China has been an important supplier in the chip \nindustry, increasing U.S.-China tensions threaten the semiconductor \nsupply ...", "source": "IoT World Today", "date": "15 Jun 2021"},
{"title": "Chip tools become latest victim of global semiconductor crunch", "excerpt": "But you won't be able to get them -- because of the shortage of chips. This \nconundrum is the latest sign of how the global semiconductor supply ...", "source": "Nikkei Asia", "date": "15 Apr 2021"},
{"title": "Why there's a chip shortage that's hurting everything from the PlayStation \n5 to the Chevy Malibu", "excerpt": "Semiconductors are in short supply because of strong demand for \nelectronics, shifting business models in the semiconductor world that \ncreated a ...", "source": "CNBC", "date": "10 Feb 2021"},
{"title": "Semiconductor investment frenzy ramps up in Asia amid chip shortages, tech \nwar", "excerpt": "This came days after it was reported by Nikkei Asia that Taiwan \nSemiconductor Manufacturing Co (TSMC), the world's largest contract chip \nmaker, ...", "source": "South China Morning Post", "date": "1 month ago"},
{"title": "China will ‘vigorously support’ semiconductor industry, IT minister says", "excerpt": "China will 'vigorously support' semiconductor industry, IT ministry head \nsays, as country seeks self-sufficiency in chip-making. The head of the ...", "source": "South China Morning Post", "date": "1 Mar 2021"},
{"title": "Why the World Is Short of Computer Chips, and Why It Matters", "excerpt": "... a similar cause: an abrupt and cascading shortage of semiconductors. \n... two Asian powerhouses — Taiwan Semiconductor Manufacturing Co.", "source": "Bloomberg.com", "date": "17 Feb 2021"},
{"title": "When the chips are down, can 007 save the semiconductor?", "excerpt": "Some will argue that, after years of what has often been fairly incoherent \nUS-China trade skirmishing, semiconductors provide the arena in which ...", "source": "Financial Times", "date": "25 Apr 2021"},
{"title": "Semiconductors are in short supply. 3 experts weigh in on what to do about \nit", "excerpt": "Semiconductors power almost any smart device you own. They're small, \ncomplex, and powerful pieces of hardware that are integral to the ...", "source": "Fortune", "date": "1 month ago"},
{"title": "What’s behind the semiconductor shortage and how long could it last?", "excerpt": "A global shortage of semiconductors has created serious anxiety in some \nindustries and even caused automakers to halt production in several ...", "source": "Brookings Institution", "date": "24 May 2021"},
{"title": "Taiwan’s foundry king says mainland China is not yet a competitor", "excerpt": "Chang, who established Taiwan Semiconductor Manufacturing Co (TSMC) in \n1987, is seen as the father of Taiwan's success in the foundry ...", "source": "South China Morning Post", "date": "22 Apr 2021"},
{"title": "Production localization new focus for Shanghai semiconductor ...", "excerpt": "A global supply crunch and US sanctions on China's leading chipmakers have \naccelerated the localization of semiconductor industry, ...", "source": "Global Times", "date": "18 Mar 2021"},
{"title": "Chinese semiconductor industry is speeding up advanced ...", "excerpt": "Some Chinese companies have shifted its 14nm chipset orders from the market \nleader Taiwan Semiconductor Manufacturing Company (TSMC) to China's ...", "source": "Total Telecom", "date": "22 Apr 2021"},
{"title": "TSMC dominance as the world’s largest chipmaker explained", "excerpt": "One company in Taiwan – Taiwan Semiconductor Manufacturing Co. – accounts \nfor more than half of the world's semiconductor foundry market in 2020 ...", "source": "Tech Wire Asia", "date": "4 Feb 2021"},
{"title": "China’s small semiconductor companies get boost from Washington hostility", "excerpt": "With TSMC, ASML and Intel nowhere to be seen, China's small semiconductor \nplayers take centre stage at industry expo. Small Chinese companies ...", "source": "South China Morning Post", "date": "7 May 2021"},
{"title": "S'pore semiconductor firms boost capacity amid global chip ...", "excerpt": "Singapore Semiconductor Industry Association (SSIA) executive director Ang \nWee Seng told The Straits Times that the high demand is forecast to ...", "source": "The Straits Times", "date": "4 Jun 2021"},
{"title": "China’s chip makers bought more new gear in 2020 than any other country", "excerpt": "US-China tech war: China becomes world's top semiconductor equipment market \nas Beijing pushes local chip industry. Taiwan was the second-largest ...", "source": "South China Morning Post", "date": "15 Apr 2021"},
{"title": "2021 will be a calmer year for semiconductors and chips ...", "excerpt": "2021 will be a calmer year for semiconductors and chips (except for Intel). \n4 trends to watch for from VC funding of silicon startups to US- ...", "source": "TechCrunch", "date": "28 Dec 2020"},
{"title": "Global chip and semiconductor industry heavily reliant on Asia", "excerpt": "Asia's stronghold on the global semiconductor market has grown so strong \nthat sanctions on China's chip production have become a source of ...", "source": "Consultancy.asia", "date": "19 Apr 2021"},
{"title": "Valens Semiconductor Expects Revenue To Sprint At 48%", "excerpt": "This comes to mind in considering 15 year old Valens Semiconductor — a Hod \nHasharon, Israel-based company — that merged with a SPAC last ...", "source": "Forbes", "date": "1 month ago"},
{"title": "Chip Shortage 2021: Semiconductors Are Hard to Make and ...", "excerpt": "Shortages of semiconductors are battering automakers and tech giants ... \nyears to build semiconductor fabrication facilities and billions of ...", "source": "Bloomberg.com", "date": "5 May 2021"},
{"title": "15 Best Semiconductor Stocks to Buy Now", "excerpt": "Semiconductor chips have a soaring demand in today's world as they are used \nin almost all the smart devices that we use.", "source": "Yahoo Finance", "date": "1 month ago"},
{"title": "Simply throwing money may not fulfill Europe's semiconductor ...", "excerpt": "The EU now has just 10 percent of global semiconductor production capacity, \nfar behind the US and Asian economies. As the COVID-19 pandemic ...", "source": "Global Times", "date": "7 May 2021"},
{"title": "US-Japan chip alliance won't contain China's rise: analysts", "excerpt": "The importance of the semiconductor supply chain has been highlighted \nrecently as several major global vehicle brands announced production \nhalts ...", "source": "Global Times", "date": "6 Apr 2021"},
{"title": "EU Weighs Deal With TSMC, Samsung for Semiconductor ...", "excerpt": "The European Union is considering building an advanced semiconductor \nfactory in Europe in an attempt to avoid relying on the U.S. and Asia ...", "source": "Bloomberg.com", "date": "10 Feb 2021"},
{"title": "AMD CEO predicts supply of TSMC-built chips to improve", "excerpt": "Su said recent chip shortages are just another example of the periodic \nimbalances between supply and demand in the semiconductor market; One ...", "source": "South China Morning Post", "date": "20 May 2021"},
{"title": "Qualcomm warns global chip shortages are spreading", "excerpt": "Qualcomm Inc, the world's largest smartphone chip maker, warned it is \nstruggling to meet demand, signalling that a global semiconductor ...", "source": "South China Morning Post", "date": "4 Feb 2021"},
{"title": "McCaul And Cotton Ask Raimondo To Tighten Controls On Semiconductor \nManufacturing Equipment", "excerpt": "... To Tighten Controls On Semiconductor Manufacturing Equipment ... on the \nsale of semiconductor manufacturing equipment (SME) to China.", "source": "Forbes", "date": "28 Apr 2021"},
{"title": "Why Businesses Are Still On A Semiconductor Waiting List", "excerpt": "A lot of companies currently are hung up because production of the \nsemiconductors that make them go is at a slowdown.", "source": "Forbes", "date": "1 month ago"},
{"title": "Semiconductor Self-Sufficiency: MIIT's Ambitions for 2021 and ...", "excerpt": "Semiconductors are a critical element of all electronic devices, including \nthose used within communications, healthcare, computing, ...", "source": "China Business Review", "date": "20 May 2021"},
{"title": "TSMC: how a Taiwanese chipmaker became a linchpin of the ...", "excerpt": "Taiwan Semiconductor Manufacturing Company, the largest contract ... \nsemiconductors expected to be up to 70 per cent faster and more ...", "source": "Financial Times", "date": "23 Mar 2021"},
{"title": "Chip giants are making more money than ever as the semiconductor shortage \nrages", "excerpt": "Around 57% of the world's chip foundry revenues in the last quarter were \ngenerated by one Taiwanese chipmaker: Taiwan Semiconductor ...", "source": "CNBC", "date": "1 Jun 2021"},
{"title": "Malaysian Tycoons’ UWC Profit Nearly Doubles Amid Global Semiconductor Boom", "excerpt": "“Semiconductor orders remain very strong,” UWC added in the ... able to \nmeet the robust global demand for semiconductors and help ease the ...", "source": "Forbes", "date": "16 Jun 2021"},
{"title": "China semiconductor imports declined in April from all-time high amid \nglobal supply constraints", "excerpt": "... The global semiconductor market continues to see strong growth, but \nshortages are expected to persist throughout the year.", "source": "South China Morning Post", "date": "7 May 2021"},
{"title": "China’s memory makers are becoming new disruptive force in sector", "excerpt": "Chinese memory chip makers could add downwards price pressure on suppliers \nin the memory chip sector. Topic | Semiconductors.", "source": "South China Morning Post", "date": "2 Jun 2021"},
{"title": "A global semiconductor shortage highlights a troubling trend: A small and \nshrinking number of the world's computer chips are made in the US", "excerpt": "Semiconductors are the logic and memory chips used in computers, phones, \nvehicles and appliances. The U.S. share of global semiconductor ...", "source": "The Conversation", "date": "9 Mar 2021"},
{"title": "China must drive chip assembly, packaging innovations, experts say", "excerpt": "The landmark US Innovation and Competition Act identifies China as a major \nrival to America's technological dominance. Topic | Semiconductors.", "source": "South China Morning Post", "date": "9 Jun 2021"},
{"title": "Why the current semiconductor shortage won’t be the last", "excerpt": "Why the semiconductor shortage hitting cars and smartphones won't be the \nlast. The last big supply chain shock was 10 years ago when the ...", "source": "South China Morning Post", "date": "22 Mar 2021"},
{"title": "Who really stands to win from the semiconductor explosion?", "excerpt": "The growth of the semiconductor industry has been rapid and there is still \nroom to grow. Dr. Nisha Long looks at the size and scale of this ...", "source": "Citywire Selector", "date": "4 Mar 2021"},
{"title": "Why Is There a Chip Shortage? Covid-19, Surging Demand ...", "excerpt": "It's also catapulted Taiwan Semiconductor Manufacturing Co. and Samsung ... \nOverall demand for semiconductors of all stripes—from basic ...", "source": "Bloomberg.com", "date": "28 Mar 2021"},
{"title": "Chinese chip foundry SMIC seeks to retain top talent with huge stock bonus", "excerpt": "... US$3.7 million in shares in effort to retain semiconductor talent ... \nself-sufficiency in semiconductors, but US sanctions and a talent ...", "source": "South China Morning Post", "date": "1 month ago"},
{"title": "Semiconductor Supply Shortage 'Fight' May Drag On Until ...", "excerpt": "WATCH: CEO Pekka Lundmark discusses 5G networks and semiconductor shortage. \nSource: Bloomberg. That would complicate Lundmark's efforts to get ...", "source": "Bloomberg.com", "date": "29 Apr 2021"},
{"title": "The semiconductor shortage is here to stay, but it will affect chip \ncompanies differently", "excerpt": "Semiconductors in the age of COVID-19: Extreme demand spike will keep chips \nin short supply for the foreseeable future, but different types of ...", "source": "MarketWatch", "date": "17 Apr 2021"},
{"title": "How Will the Global Semiconductor Crunch Impact South ...", "excerpt": "Semiconductors are as ubiquitous as they are crucial to the modern economy \nand yet they are in short supply this year.", "source": "The Diplomat", "date": "1 Apr 2021"},
{"title": "Taiwan uses ‘geopolitical heft’ to boost China investment, despite tensions", "excerpt": "Global demand for semiconductors used in everything from computers to cars \nis proving a boon to Taiwanese manufacturers, who are ramping up ...", "source": "South China Morning Post", "date": "12 May 2021"},
{"title": "This semiconductor stock could determine the chipmakers' next move, \nstrategist says", "excerpt": "Semiconductor stocks sat out the tech rally this week, and one strategist \nsaid a single chipmaker could point to their next move.", "source": "CNBC", "date": "11 Jun 2021"},
{"title": "China's semiconductor revolution: From crisis to self-sufficiency", "excerpt": "We spoke to Hui He, Associate Director and Head of China Semiconductor \nResearch at Omdia, about the severity of the ongoing semiconductor \nsupply ...", "source": "Total Telecom", "date": "15 Jun 2021"},
{"title": "How Wuhan’s dream chip project became a nightmare", "excerpt": "China's semiconductors: How Wuhan's challenger to Chinese chip champion \nSMIC turned from dream to nightmare. Hopes that the HSMC facility could ...", "source": "South China Morning Post", "date": "20 Mar 2021"},
{"title": "China wants disruptive chip tech to prepare for Moore’s Law demise", "excerpt": "China seeks to boost its domestic chip-making capability amid a protracted \ntech war with the US. Topic | Semiconductors.", "source": "South China Morning Post", "date": "15 May 2021"},
{"title": "White House Sets First Steps on Semiconductor, Mineral ...", "excerpt": "On the semiconductors front, the White House said the government is ... the \nprivate sector in domestic semiconductor manufacturing and R&D.", "source": "MeriTalk", "date": "8 Jun 2021"},
{"title": "Senate approves billions for US semiconductor manufacturing", "excerpt": "The bill invests billions into emerging technology industries like \nartificial intelligence, semiconductors, and quantum computing in the US.", "source": "The Verge", "date": "8 Jun 2021"},
{"title": "Controversial Wuhan semiconductor maker dismisses all staff ...", "excerpt": "Chinese controversial semiconductor maker Wuhan Hongxin Semiconductor \nManufacturing Co (HSMC) has reportedly issued a noticed to dismiss all ...", "source": "Global Times", "date": "28 Feb 2021"},
{"title": "Welsh semiconductor firm bought by Chinese company", "excerpt": "Newport Wafer Fab is an electronics firm which produces semiconductors and \nemploys 450 people at its site in Tredegar Park.", "source": "BBC", "date": "1 month ago"},
{"title": "Micron CEO sees semiconductor growth as cars become 'data centers on \nwheels' and 5G rolls out", "excerpt": "Micron Technology sees immense growth for semiconductors in 5G and electric \nvehicles, CEO Sanjay Mehrotra told CNBC on Thursday.", "source": "CNBC", "date": "1 month ago"},
{"title": "TSMC's Japan project attracts over 20 participant companies", "excerpt": "... Taiwan Semiconductor Manufacturing Co. to develop cutting-edge ... \nwhich vertically layers semiconductors -- and to do so in Japan.", "source": "Nikkei Asia", "date": "31 May 2021"},
{"title": "Semiconductor Industry Growth Spikes, But Supply Remains ...", "excerpt": "Demand for semiconductors is white-hot as remote work and the appetite for \nconsumer electronics continue unabated. But supply chain dysfunction ...", "source": "IoT World Today", "date": "13 May 2021"},
{"title": "Why you should pay attention to China's semiconductor industry", "excerpt": "As part of its Made in China 2025 plan, China aims to produce 70 per cent \nof all the semiconductors it requires by 2025, with a longer term ...", "source": "The Business Times", "date": "5 May 2021"},
{"title": "Tough road ahead for U.S. firms trying to cut reliance on Taiwan chipmakers", "excerpt": "Asian countries produce more than 70% of global semiconductors — Taiwan and \nSouth ... Taiwan Semiconductor Manufacturing Company (TSMC), ...", "source": "CNBC", "date": "13 Apr 2021"},
{"title": "Why Trailing Edge Semiconductor Manufacturing Matters", "excerpt": "The need for processors on larger nodes is also constrained as most of the \nmajor semiconductor fabs have opted to invest in leading edge ...", "source": "Forbes", "date": "13 May 2021"},
{"title": "The Biden administration is working to help address global semiconductor \nchip shortage", "excerpt": "The White House has pledged to help address the ongoing global \nsemiconductor shortage, with President Joe Biden said to be signing an ...", "source": "The Verge", "date": "11 Feb 2021"},
{"title": "Investors rush into semiconductor stocks amid global chip ...", "excerpt": "TOKYO -- Semiconductor and related companies -- hobbled by supply chain \nproblems and unable to keep up with a deluge of orders from the ...", "source": "Nikkei Asia", "date": "18 Jan 2021"},
{"title": "TSMC joins US chip coalition in a potential blow to China", "excerpt": "The Semiconductors in America Coalition (SIAC), which includes 65 major \nplayers along the semiconductor value chain, announced its formation on ...", "source": "South China Morning Post", "date": "12 May 2021"},
{"title": "CEO of largest U.S. chip foundry explains why semiconductor shortage could \nlast through 2022", "excerpt": "A shortage of semiconductor microchips is causing havoc around the world. \nGlobalFoundries, the third-largest foundry, is planning to invest ...", "source": "CNBC", "date": "2 Apr 2021"},
{"title": "10 Hottest Semiconductor Companies To Watch In 2021", "excerpt": "A look at some of the hottest chip startups and semiconductor giants in \n2021 that are making big, bold moves and shaping the future of IT ...", "source": "CRN", "date": "29 Mar 2021"},
{"title": "How the Number One U.S. Semiconductor Company Stumbled", "excerpt": "On this episode, we speak with Stacy Rasgon, a semiconductor analyst at \nBernstein Research on Intel and the general state of U.S. high-tech ...", "source": "Bloomberg.com", "date": "30 Nov 2020"},
{"title": "Will a Chip Czar Guarantee China Success? It's a Moon Shot", "excerpt": "Semiconductor Manufacturing International Corp., the nation's flagbearer in \nmanufacturing, is still around six years behind global leaders ...", "source": "Bloomberg.com", "date": "17 Jun 2021"},
{"title": "Amid global semiconductor headwinds, Apple finds solace in ...", "excerpt": "Companies worldwide have been faced with an unprecedented shortage in \nsemiconductor chips that shows no signs of abating as companies ...", "source": "S&P Global", "date": "27 Apr 2021"},
{"title": "Gartner Reveals Global Semiconductor Revenue Grew by ...", "excerpt": "According to Gartner, the world saw semiconductor revenue growth of 10.4% \nin 2020, showing that supply chain disruptions do not dampen ...", "source": "Supply Chain Digital", "date": "12 Apr 2021"},
{"title": "The Semiconductor Industry’s Competitive Dilemma", "excerpt": "TSMC is not a leading edge semiconductor foundry monopoly yet. However, we \nare seeing a glimpse of what the world may look like if TSMC is the ...", "source": "Forbes", "date": "4 Mar 2021"},
{"title": "Defense Magazine Semiconductor Shortage Shines Light On ...", "excerpt": "Semiconductors are the foundation of the advanced technologies that regular \ncitizens and military officials rely on — from cell phones and ...", "source": "National Defense Magazine", "date": "21 May 2021"},
{"title": "China’s top chip maker quadruples salary for senior Taiwanese executive", "excerpt": "Semiconductor giant SMIC rewards senior Taiwanese executive with hefty \ncompensation as China builds up chip sector's hi-tech talent pool. SMIC ...", "source": "South China Morning Post", "date": "7 Apr 2021"},
{"title": "Taiwan drought at 'most critical' phase for chip sector", "excerpt": "Taichung has suffered the worst of a dry spell that has emerged as a threat \nto Taiwan's semiconductor device production.", "source": "Nikkei Asia", "date": "28 Apr 2021"},
{"title": "Semiconductor-starved mainland China fuelling surge in exports from Taiwan", "excerpt": "Semiconductor-starved mainland China seen driving long-term surge in \nexports from Taiwan. Global chip shortage – caused by a glut in \npandemic- ...", "source": "South China Morning Post", "date": "23 Apr 2021"},
{"title": "Chip working group won’t ease tensions but a seen as good start", "excerpt": "... However, trade tensions in the semiconductor sector would not be eased \nany time soon amid US-China rivalry, say analysts.", "source": "South China Morning Post", "date": "13 Mar 2021"},
{"title": "Taiwan Semiconductor Stock: How to Play the World’s Most Important Chip \nMaker.", "excerpt": "Taiwan Semiconductor accounts for roughly 60% of outsourced chip \nmanufacturing and 90% of the profits. Illustration by Robert Connolly; ...", "source": "Barron's", "date": "11 Jun 2021"},
{"title": "The 10 Hottest Semiconductor Startups Of 2021 (So Far)", "excerpt": "These startups are taking on semiconductor heavyweights like Intel and \nNvidia with new kinds of silicon solutions for compute, ...", "source": "CRN", "date": "16 Jun 2021"},
{"title": "For The First Time, Scientists Have Connected a Superconductor to a \nSemiconductor", "excerpt": "Semiconductors are key to the electrical gadgets that dominate our lives, \nfrom TVs to phones. What makes them so useful as opposed to regular ...", "source": "ScienceAlert", "date": "1 month ago"},
{"title": "Infineon (IFX:GR) Hits Targets Helped by 'Booming ...", "excerpt": "German semiconductor manufacturer Infineon Technologies AG said about 2.5 \nmillion cars won't be produced in the first half of 2021 due to ...", "source": "Bloomberg.com", "date": "3 May 2021"},
{"title": "China Is Failing at Making Semiconductor Chips, Showing ...", "excerpt": "Silicon-based semiconductors are used in all sorts of computer chips, ... \nChina's most advanced chip foundry is Semiconductor Manufacturing ...", "source": "Foreign Policy", "date": "14 Dec 2020"},
{"title": "Renesas says fire-hit chip plant to resume full production in May", "excerpt": "The shortage of semiconductors has squeezed global automakers' output. ... \nincluding Taiwan Semiconductor Manufacturing Co.", "source": "Nikkei Asia", "date": "19 Apr 2021"},
{"title": "How Samsung fell behind TSMC in the race for cutting-edge ...", "excerpt": "Though non-memory semiconductors manufactured on a contract basis account \nfor only 7% of total semiconductor sales, the performance of Samsung's ...", "source": "Nikkei Asia", "date": "10 May 2021"},
{"title": "Semiconductor shortage takes toll", "excerpt": "Semiconductors are the brain of modern electronic devices, enabling highly \nadvanced technologies in healthcare, communications, computing and ...", "source": "The Bangkok Post", "date": "12 Feb 2021"},
{"title": "5 Semiconductor Stocks With Huge Potential to Buy on the Dip", "excerpt": "The semiconductor industry is having a mixed year. In continuation of last \nyear's astonishing performance by the broader technology sector, ...", "source": "Yahoo Finance", "date": "18 May 2021"},
{"title": "Data reveals patenting in semiconductors is on the rise, with ...", "excerpt": "Analysis of semiconductor-related patent publications, with respect to \navailable data from the USPTO, EPO and CNIPA, demonstrates consistent ...", "source": "IAM Media", "date": "18 May 2021"},
{"title": "Geopolitics and the push for 'made in the USA' semiconductors", "excerpt": "US and Taiwanese semiconductor powerhouses Intel and TSMC have both \nrecently announced plans to build giant semiconductor plants in Arizona.", "source": "East Asia Forum", "date": "19 May 2021"},
{"title": "Chips Designed By AI Are The Future Of Semiconductor Evolution Beyond \nMoore's Law", "excerpt": "We are currently in the midst of a global semiconductor shortage that is \nnegatively impacting the entire technology supply chain.", "source": "Forbes", "date": "25 May 2021"}
]